{

  "Changes": [

    {
      "LogName": "Epilogue pt 1 - Dandelion Proposes", 
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_LionsMane", 
      "Entries": {
        "SnS.Ch5.Dandelion.1/f Dandelion 2000/t 800 2200/n DuskspireDefeated/F": "SnS.RoslinTheme/-100 -100/farmer 3 21 0 Roslin 6 16 3 Dandelion 5 16 1 Solomon 12 26 2 Cirrus 18 32 1 Juliet 19 31 2 Jessie 20 31 2 MadDog.HashtagBearFam.Sigurd? 28 27 2 MadDog.HashtagBearFam.Teren? 27 30 0 MadDog.HashtagBearFam.Gunnar? 29 30 0 Hector 11 31 2 Mateo 4 30 3/removeTile 18 32 Buildings/animate Solomon false true 100 28 28 29 29 30 30 31 31 32 32 33 33 34 34 35 35 36 36 37 37 38 38 39 39 40 40/globalFadeToClear/skippable/addConversationTopic FullmetalDandelion {{VariableTimegate}}/viewport 10 20 clamp true/pause 1000/playSound doorOpen/doAction 3 22/advancedMove farmer false 0 -2 4 10/emote farmer 8/speak Roslin \"Are you serious? You want to go adventuring? Dandelion, after everything we've JUST been through?$5\"/jump farmer 5/advancedMove farmer false -1 0 4 10/speak Dandelion \"No, no, no. You're misunderstanding. I said I wanted to embark on a NEW adventure.$6\"/speak Roslin \"Dandelion, I swear to the void-$8\"/speak Dandelion \"With you, Roslin. A new adventure with you.$12\"/emote Roslin 40/shake Roslin 2000/speak Roslin \"What exactly are you saying?$15\"/showFrame Dandelion 34/pause 250/emote Roslin 16 true/jump Roslin 5/pause 250/speak Dandelion \"Roslin, will you marry me?$4\"/speak Roslin \"Dandelion, we've been common-law married for a decade! Together for almost two!$16\"/speak Dandelion \"Has it been that long?$16#$b#Being with you really makes time fly.$14\"/speak Roslin \"You're daft.$13\"/speak Dandelion \"Perhaps. Consider this me making it official-official, then.$4\"/pause 250/message \"Dandelion hands Roslin a Mermaid Pendant, which shines a brilliant, solid gold.\"/speak Dandelion \"I made this out of my armor, since... well, I shouldn't be needing it anymore. We're domestic now, after all!$6\"/shake Roslin 2000/textAboveHead Roslin \"About to be HAVING a domestic, more like...\"/pause 250/advancedMove Roslin false 0 1 -2 0 0 -2 4 10/waitForAllStationary/playSound pickUpItem/emote Dandelion 8/pause 500/advancedMove Roslin false 0 2 2 0 0 -1 3 10/emote Dandelion 40 true/emote Roslin 40 true/waitForAllStationary/message \"Roslin hands Dandelion a Mermaid Pendant, which looks shaped from The Void itself.\"/shake Dandelion 2000/speak Roslin \"...Yes, obviously. The answer is yes.$3\"/playSound leafrustle/jump Dandelion 5 true/faceDirection Dandelion 2 true/emote Dandelion 16 true/jump Roslin 5 true/faceDirection Roslin 2 true/emote Roslin 12 true/pause 250/speed farmer 5/advancedMove farmer false 1 0 0 8 3 0 0 5 10 2/emote farmer 60/pause 250/faceDirection Mateo 1 true/emote Mateo 8 true/faceDirection Hector 3 true/emote Hector 8 true/fade/viewport -1000 -1000/pause 1000/stopAdvancedMoves/end"
      }
    },

    {
      "LogName": "Epilogue pt 2 - Wyatt Returns", 
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_CoastalGuild", 
      "Entries": {
        "SnS.Ch5.Mateo.1/e SnS.Ch4.Dandelion.1/f Mateo 2000/t 800 2200/n DuskspireDefeated/F": "SnS.MateoTheme/-100 -100/farmer 100 -100 2 Mateo 20 14 2/addTemporaryActor MateoEmeritus 32 32 2 17 2 true Character/changeName MateoEmeritus Emeritus/animate MateoEmeritus false true 500 23 24 25 26 0 23/addTemporaryActor MateoWyatt 16 32 12 13 0 true Character/changeName MateoWyatt Wyatt/skippable/viewport 12 12/globalFadeToClear/pause 500/advancedMove Mateo false -2 0 0 -1 -4 0 3 10/textAboveHead Mateo \"Who goes?\"/pause 250/warp farmer 20 14/advancedMove farmer false -2 0 0 -1 -3 0 0 -1 -1 0 3 10/pause 250/faceDirection MateoWyatt 1/speak MateoWyatt \"Howdy, Mateo.$9\"/speak Mateo \"Wyatt?$26#$b#You've got some nerve, showing up here-$24\"/speak MateoWyatt \"I'll have you know Lewis, Marlon and Gunther have all read me to rights already.$7\"/speak Mateo \"You... went to see them?$10\"/speak MateoWyatt \"I did. I'm here to make apologies and offer repirations, Mateo. I couldn't leave them out. I know I've done a whole town's worth of people wrong.$6\"/shake Mateo 1000/emote Mateo 40/pause 500/speak MateoWyatt \"If you're open to listenin', I'll explain myself. But I understand if you don't want to hear it - in that case, I won't bother you no more.$4\"/faceDirection Mateo 0 true/faceDirection farmer 2/quickQuestion #Give him the chance you didn't expect others to give you. #This is your choice, you're not obligated to someone who hurt you.(break)speak Mateo \"You're right. When I was in his shoes, you gave me a chance. It's my turn to pass that forward.$80\"(break)speak Mateo \"You're right, it is my choice. And... I'm choosing to hear him out. I don't owe him that, but that means I don't owe him anything more, either.$80\"/faceDirection Mateo 3 true/faceDirection farmer 3/speak MateoWyatt \"Thank you. Honestly, I ain't even sure where to start.$6\"/speak Mateo \"The beginning's fine.$37\"/shake MateoWyatt 1000/emote MateoWyatt 40/pause 250/speak MateoWyatt \"...I was pretty poorly, Mateo. When trying to raise you. I did my best, but adventurin' n' minin' wasn't terribly lucrative.$7#$b#I didn't want ya' to lead that life. Facing down dangers just to make ends meet.$9#$b#It damn near well broke my heart when Marlon told me what happened with the Shadow Folk. I had no idea, all your papers make no mention-$6\"/speak Mateo \"You've read them?$29\"/speak MateoWyatt \"Everything you've ever published.$5#$b#But I didn't want you to get hurt, 'Teo. I wanted you to go school good and proper, and maybe do something with you education that wasn't so adjacent to violence.$9\"/shake Mateo 1000/emote Mateo 40/pause 250/speak MateoWyatt \"I figured, sellin' the collection would pay your way. You wouldn't be saddled with debts or nothin', you'd get to focus on your grades.$6#$b#But that choice I made hurt folks, and it drove you away. Rightfully so, but it was the opprotunity I had at the time.$7#$b#Workin' with Joja was like a deal with the devil, in the end.$6\"/speak Mateo \"I can't honestly say I would've understood or cared about any of that, before I had a guild's worth of people who's well-being I concern myself with.$2\"/speak MateoWyatt \"I've missed every important milestone in your life, and I'm sorry for that. I'm sorry that my short-signtedness drove a wedge between us.$9#$b#I'm sorry I didn't own up sooner. And I'm sorry for all the hurt n' grief I caused you.$9\"/faceDirection farmer 2/emote farmer 40/pause 1000/speak Mateo \"I forgive you.\"/shake MateoWyatt 1000/speak MateoWyatt \"Thank you, 'Teo. But I, uh, I ain't done. Joja's money is long gone, but I've been savin'.$9#$b#Would you... let me pay down the rest of yer' loans? I understand if not, but I'd always considered your education my responsibility.$6\"/speak Mateo \"That's going pretty far, Wyatt-$26\"/speak MateoWyatt \"Nah, it ain't. S'was my goal from the start. Just trying to do what I set out for in a more legitamate way.$5\"/speak Mateo \"I'll definitely think about it. It'd be nice to have that burden off my shoulders.$12#$b#I do have another project in mind, if you'd maybe... be interested in helping...$78\"/jump MateoWyatt 5/speak MateoWyatt \"A'course, 'Teo. What's on yer' mind?$8\"/advancedMove farmer false -5 0 0 5 2 10/pause 500/fade/viewport -1000 -1000/speak Mateo \"Well, I've been meaning to add something of a library to this building for ages, maybe with some room for wayward adventurers...$76\"/speak MateoWyatt \"Say no more, 'Teo. Least I can do for you right now is roll up my sleeves and get to work...$5\"/pause 500/end"
      }
    },

    {
			"LogName": "Epilogue pt 3 - Hector Gets Promoted",
			"Action": "EditData",
			"Target": "Data/Events/EastScarp_VetHouse",
			"Entries": { 
	  
			  "SnS.Ch5.Hector.1/e SnS.Ch4.Mateo.1/f Hector 2000/t 800 2200/n DuskspireDefeated/F": "{{season}}_day_ambient/-100 -100/farmer 12 27 0 Hector 10 24 3 RichieTheMacaw 8 21 2 Jacob 8 24 1 Eloise 9 23 2/skippable/playSound doorOpen/viewport 10 26/globalFadeToClear/emote farmer 8/advancedMove farmer false 0 -3 3 10/speak Jacob \"Biróg, you've done great today, but there was something I wanted to talk to you about.\"/shake Hector 500/emote Hector 28/speak Hector \"Is this a serious talk? Why is Eloise here?$2\"/emote Eloise 8 true/emote Jacob 8 true/speak Jacob \"What do you mean?$2\"/speak Eloise \"You're not in trouble, if that's what you're wondering.$1\"/speak Hector \"It was. Thanks, Eloise.$4\"/jump Eloise 5 true/emote Eloise 20 true/speak Eloise \"No problem!\"/pause 250/speak Hector \"So, what's up then, Jacob?$8\"/speak Jacob \"Were you worried I was letting you go, or something?$2\"/speak Hector \"Honestly, yeah. I just... love this job, so a 'serious talk' got me nervous.$2\"/speak Jacob \"Well, that's on me - serious talk, yes, but a positive one.$1#$b#Does that sound better?\"/textAboveHead Hector \"Yup!\"/pause 1000/speak Jacob \"You spend a lot of time here, and you help me with all sorts of tasks around the office. I really appreciate that.#$b#I was wondering if you'd be interested in taking the next step.$1\"/speak Hector \"Guess that depends on what that is.\"/speak Eloise \"Dad wants you to start working on the patients with him!$1\"/jump Hector 5 true/emote Hector 16 true/speak Hector \"Wait, really? Holy-$17\"/speak Jacob \"Language!$1#$b#But, yes. You've been working more hours, you've been very present for us... I trust you, and all of the animals take a liking to you immediately.#$b#It's like you know what they're saying.\"/textAboveHead Eloise \"Hehe!\"/pause 2000/emote Jacob 8/pause 250/speak Eloise \"Talking to animals. That would be funny, wouldn't it Biróg?$1\"/emote Hector 60/speak Hector \"Sure would.$4\"/pause 250/speak Jacob \"So you're interested, then? In a more formal apprenticeship?$1\"/speak Hector \"Yes!$1\"/speak Eloise \"You know, it's got a lot to do with you feeling better.\"/emote Hector 8/speak Jacob \"Your health. You've seemed happier, more energized...$1\"/speak Eloise \"You gave yourself time to heal. It shows.$1\"/speak Hector \"I guess it does, doesn't it?$12\"/advancedMove farmer false 0 3 2 10/pause 50/fade/viewport -1000 -1000/speak Hector \"A lot of that has to do with @, but... thank you, Jacob. Eloise.\"/speak Jacob \"We'll get into it next week, but I'll give you some reading materials to take home to get you started...$1\"/end"
			}
	  
		},

  ]

}

/* 

quickQuestion #That girl sounds overwhelmed. #That voice is familiar.(break)speak Mateo \"Let's check in on things, just in case.$32\"(break)speak Hector \"Right? Reminds me of something I was watching with Eloise...$7\"

(0 = up, 1 = right, 2 = down, 3 = left)

waitForAllStationary - waits until all advMoves are complete for next action 

stopAdvancedMoves - will prevent clipping issues at the end of an event when characters advMove off screen

advancedMove true/false (loop) parameters

parameters:
x y x y x y = move without pause

x y z t x y z t = move with pauses

x y x y z t x y = move with mix of mentioned above

x = how many tiles move in x axis (+ = right, - = left)
y = how many tiles move in y axis (+ = down, - = up)
z = direction face upon reaching destination (1=right, 2=down, 3=left, 4=up)
t = duration in milliseconds how long to stay in that spot (must be >= 10000ms)

4- empty can
8- question mark
12- angry
16- exclamation
20- heart
24- sleep
28- sad
32- happy
36- x
40- pause
52- video game
56- music note
60- blush 

*/
