{
  "Changes": [
    {
      "LogName": "Roslin's 0 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_CoastalGuild",
      "Entries": {
        "SnS.Ch4.Roslin.1/e SnS.Ch3.Cirrus.14/f Mateo 2500/f Hector 2500/f Cirrus 2500/t 800 2200/A CirrusLionsMane3/w sunny/F": "SnS.MateoTheme/-100 -100/farmer 9 14 2 Cirrus 14 12 0 Mateo 24 15 2 Hector 5 16 3 Roslin -100 -100 0/skippable/addConversationTopic RoslinNeedsHelp {{VariableTimegate}}/addTemporaryActor MateoEmeritus 32 32 2 17 2 true Character/globalFadeToClear/changeName MateoEmeritus Emeritus/viewport 13 12 clamp true/pause 1000/emote Mateo 40/pause 250/speak Hector \"Mateo, doesn't Emeritus lay eggs?$8\"/faceDirection Mateo 3/speak Mateo \"Yup!$1\"/faceDirection Cirrus 2/speak Cirrus \"...I thought Emeritus was a boy.$17\"/speak Mateo \"To be honest, I've just never questioned it.$32\"/speak MateoEmeritus \"Huuuuuuuur!\"/speak Hector \"I see, I see. So you don't mind either way. Understood, Emeritus.$14#$b#Wait, also, it takes two to tango - where are the eggs coming from, then-$23\"/stopMusic/pause 250/playSound stoneStep/faceDirection Hector 1/warp Roslin 10 19/advancedMove Roslin false 0 -5 3 10/emote Mateo 8 true/emote Cirrus 8 true/emote Hector 8 true/pause 250/faceDirection farmer 1/speak Roslin \"You, farmer. I...$9#$b#I need your help.$8\"/playMusic SnS.LonelyTheme/advancedMove Hector false 5 0 4 10/advancedMove Cirrus false -4 0 2 10/advancedMove Mateo false -5 0 0 -1 -1 0 0 -1 -7 0 0 1 3 10/speak Hector \"You reek of Void magic. Who are you? @, how do you know this person?$16\"/speak Cirrus \"I've never seen her before.$16\"/speak Roslin \"You don't WANT to have seen me around. I've said it before, it would've been better off if I'd never spoken to @ again.$5\"/speak Mateo \"Alright, let's settle down. Who are you, and what do you need help with?$10\"/quickQuestion #This is Roslin, she and another adventurer were investigating something underneath East Scarp. #(Let Roslin introduce herself.)(break)speak Roslin \"Thank you, @.$1\"\\friendship Roslin 25(break)speak Roslin \"My name is Roslin. Archmagus of the White Lodge, Aethric Champion, Sorcerer Supreme - ah, whatever.$13#$b#My companion and I were investigating something underneath your town, and it's gone haywire.$14\"\\emote farmer 16/speak Roslin \"I'll try and keep things concise. Around when @ moved to the Valley, Dandelion, the aforementioned companion and I...$2#$b#Well, we started looking into a magical disturbance centered here, in East Scarp.$16#$b#We notified your mayor when we suspected the townsfolk were in danger, but he dismissed us; as did Marlon.$15\"/speak Mateo \"Marlon wouldn't dismiss a problem if there really was one-$16\"/speak Roslin \"You're right, he probably wouldn't. But I've long since abdicated my position in the White Lodge - erm, a court of sorcerers...$13#$b#And Dandelion has refused to join Marlon's ranks in the past.$5#$b#I suppose it's not entirely unreasonable for him to be cautious.$9\"/speak Mateo \"Can you fill us in on what you're investigating?$10\"/faceDirection Roslin 1/speak Roslin \"{{RoslinStygiumComment}}\"/emote Mateo 8/speak Roslin \"Stygium is a material uniquely coalesced from lingering feelings, positive or negative.$5#$b#I don't know who's familiar with East Scarp's history, but tragedy has struck that mine in the past...$15\"/speak Hector \"There was a collapse. Nearly a town's worth of workers got trapped down there.$23\"/speak Roslin \"Correct. And when their hopes and dreams got crushed under the rubble, all that remained was the negative feelings. All of their darkness, all of their Void energy.$16\"/speak Mateo \"So that's where the Stygium comes from, but was there something else?$34\"/speak Hector \"Actually, I see what Roslin's getting at. An incident that substantial may have created-$2\"/speak Roslin \"-A monster, formed entirely from grief. Something unlike anything Dandelion and I have fought before.$2#$b#She went to scout a while back and hasn't returned. I expect the worst.$13\"/emote farmer 16 true/emote Cirrus 16 true/emote Mateo 16 true/emote Hector 40 true/speak Hector \"I assume such a talented sorcerer to have prepared for such an outcome.$8\"/speak Roslin \"Of course I did. But I'll need some assistance seeing it through.$11#$b#I cast a spell on Dandelion that, should she receive a fatal blow, she would be unable to truly die - I already suspect this had an unintentional side effect.$2#$b#Regardless, I'll need a slew of ritual components for the second portion of this. Namely, essences of all sorts.$7\"/speak Cirrus \"Void... solar, and Druidic?$2\"/speak Roslin \"And more! Fire, water, air, and earth essences as well. You need to be particularly in tune with magic to be able to see them. And that's where you come in, @.$9#$b#Close your eyes, think deeply of your own potential... Let me help you reach it...$11\"/fade/viewport -1000 -1000/warp farmer -100 -100/faceDirection farmer 2/viewport -100 -100/fade/startJittering/sns_essenceunlock -100 -100/showFrame farmer 94/pause 10000/message \"You've unlocked the ability to sense Elemental Essences! They drop from various sources in the world.\"/fade/viewport -1000 -1000/warp farmer 9 14/faceDirection farmer 1/faceDirection Roslin 3/viewport 13 12 clamp true/pause 1000/speak Roslin \"Now, if you can help me, we may be able to save Dandelion. With her back on our side, we can deal with the beast.$9\"/speak Cirrus \"Are you... going to be okay, Roslin? I mean, if Dandelion's your companion and she's-$2\"/speak Roslin \"No reason to dwell. Not when I've already presented a potential solution.$13\"/speak Mateo \"Roslin, I know we just met, but that's not he-$2\"/jump Roslin 5/emote Roslin 12/speak Roslin \"I said I don't want to think about it - let's just focus on the matter at hand!$5\"/emote Mateo 28/pause 250/fade/viewport -1000 -1000/speak Hector \"A monster lingering under the Scarp... that would explain why the chronic fatigue continued on after the river was purified...$23\"/speak Mateo \"We'll get this sorted. That's what the Adventurer's Guild is for, after all!$14\"/speak Cirrus \"I'm worried about Roslin...$2\"/pause 250/addSpecialOrder CAGQuest.UntimedSpecialOrder.RoslinEssence/end",
      },
    },
    {
      "LogName": "Roslin's 1 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/ManorHouse",
      "Entries": {
        "SnS.Ch4.Roslin.2/e SnS.Ch4.Roslin.1/f Roslin 250/t 800 2200/A RoslinNeedsHelp3/w sunny/F": "SnS.LonelyTheme/-100 -100/farmer -100 -100 0 Lewis 6 6 1 Roslin -100 -100 0 Mateo -100 -100 0/addTemporaryActor MateoMarlon 16 32 8 6 3 true Character/skippable/addConversationTopic RoslinAndMateo {{VariableTimegate}}/fade/viewport 7 9 clamp true/pause 1000/changeName MateoMarlon Marlon/speak MateoMarlon \"The adventurers you're referring to - Dandelion and Roslin... I've looked into them since the last time we spoke.$5#$b#The former is not aligned with The Guild, and the latter left her conclave of sorcerers.$3#$b#I don't have the context, but it doesn't bode will. I understand why their warnings can be difficult to heed.$0\"/pause 250/emote Lewis 40/pause 250/speak Lewis \"Marlon, I need you to understand that I don't really comprehend what that means.$2#$b#I'm not willfully ignorant, but your world and your responsibilities are different than mine.$2#$b#I don't want it to seem like their warnings aren't weighing heavily on my shoulders, I'm worried for the townsfolk over a problem I can't comprehend-\"/playSound doorOpen/warp Roslin 4 11/warp Mateo 5 11/advancedMove Mateo false 0 -3 3 0 4 10/pause 500/advancedMove Roslin false 0 -3 2 0 4 10/pause 1000/warp farmer 4 11/advancedMove farmer false 0 -4 1 0 1 10/faceDirection MateoMarlon 2 true/faceDirection Lewis 2 true/jump Lewis 5 true/emote Lewis 16 true/emote MateoMarlon 40/pause 500/speak Roslin \"I've got words for you, Mayor!$15\"/speak MateoMarlon \"Now, Roslin, I understand you may take issue with how Lewis is handling things, but-$2\"/speak Roslin \"Dandelion is gone. I don't care for your platitudes.$16\"/speak Lewis \"Gone? You mean to say-?$3\"/speak Roslin \"I'm assuming the worst. Her absence confirms my suspicions that there IS, in fact, a monster residing underneath The Scarp. As we originally warned.$15\"/emote Lewis 16 true/emote MateoMarlon 16 true/pause 250/speak Lewis \"Oh my goodness, Roslin, I'm so sorry-$2\"/speak Roslin \"It's too late for you to be sorry! But it's not too late for you to do something. Anything!$5\"/pause 250/speak MateoMarlon \"Mateo, what say you of the situation?$2\"/speak Mateo \"I'm really disappointed this has been a danger the entire time I've been back in The Valley, and that our Mayor was keeping it from us.$5#$b#I'm also frustrated you didn't say anything if you knew, Marlon.$6\"/speak MateoMarlon \"Mateo, you don't know the circumstances surrounding these adventurers. The cards are stacked against them; they seem untrustworthy-$5\"/speak Mateo \"So was I.$8\"/shake Lewis 1000/emote Lewis 12/pause 1000/speak Mateo \"As the Master of the Coastal Adventurer's Guild, I will be assisting regardless of your input or permission.$10\"/speak MateoMarlon \"Mateo-$2\"/speak Mateo \"C'mon, Roslin. @. I don't think this is going to be productive, after all.$16\"/speak Roslin \"You're right. Anger won't do us any good, we're wasting precious time.$2#$b#Dandelion has given enough of her physical self to the Adventurer's Guild, anyway.$16\"/emote MateoMarlon 8/advancedMove Roslin false -1 0 0 3 2 10/advancedMove Mateo false -4 0 0 3 2 10/waitForAllStationary/warp Mateo -100 -100/warp Roslin -100 -100/playSound doorClose/advancedMove farmer false 2 0 4 10/pause 500/quickQuestion #Lewis, there HAS to be something you can do. #Marlon, you should know better than to pass judgement like that.(break)speak Lewis \"You're right, @... I just need to figure out what. I can do better, just give me some time. This is all very over my head.$2\"(break)speak MateoMarlon \"Aye, you're right, @... they were right to call me out. Lewis and I will figure out what support we can muster.$2\"/pause 250/emote farmer 32/pause 250/fade/viewport -1000 -1000/speak MateoMarlon \"Mateo's come a long way, callin' me out on my blunders... Feels like only yesterday they were hidin' from me.$2\"/speak Lewis \"I'll do what I can to make things right... I just need help figuring out what to do, and how to do it...$2\"/speak MateoMarlon \"Don't worry, Lewis. Looks like we've got some mistakes to atone for together.$2\"/end",
      },
    },
    {
      "LogName": "Roslin's 2 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_DeepMountains",
      "Entries": {
        "SnS.Ch4.Roslin.3/e SnS.Ch4.Roslin.2/f Roslin 500/t 800 2200/A RoslinAndMateo/w sunny/F": "SnS.HectorTheme/-100 -100/farmer 16 24 0 Hector -100 -100 0 Roslin -100 -100 0/globalFadeToClear/skippable/changePortrait Hector truedown/changeSprite Hector truedown/addConversationTopic RoslinAndHector {{VariableTimegate}}/viewport 17 16 clamp true/pause 1000/faceDirection farmer 3/pause 200/faceDirection farmer 1/pause 200/faceDirection farmer 0/emote farmer 40/pause 200/advancedMove farmer false 0 -20 4 10/pause 2000/emote farmer 8/pause 2000/fade/viewport -200 -200/message \"You hear voices coming from Hector's glade.\"/waitForAllStationary/changeLocation EastScarp_HectorForest/warp Hector 21 21/faceDirection Hector 1/warp Roslin 23 21/faceDirection Roslin 3/warp farmer 22 31/faceDirection farmer 0/viewport 21 22/advancedMove farmer false 0 -9 4 10/pause 3000/speak Hector \"Can you repeat the vocal component of the spell one more time?$23\"/speak Roslin \"'Let her blood leave no stain, let her feel no pain, let her bones never break.'$13\"/emote farmer 8/speak Hector \"If that worked, it sounds very open ended... it could've done anything, like turn her into an inanimate object. Technically, that fits the description of a scarecrow.$16\"/speak Roslin \"Not that I don't appreciate the help, but how do you know so much about sorcery, Druid?$9\"/speak Hector \"Aether is aether. Manipulating it comes down to one thing, regardless of it's form: Intention.$14\"/speak Roslin \"I know I've been told that before... have we met? Your name isn't exactly common, and yet, it's familiar...$9\"/speak Hector \"Perhaps, back when I led the Circle of Thorns. I was much more active outside Stardew Valley back then.$6\"/jump farmer 5 true/emote farmer 16/pause 250/faceDirection Hector 2 true/faceDirection Roslin 2/speak Hector \"Try not to be so surprised. I was the leader of a druid conclave years and years ago - before East Scarp was even settled.$7#$b#One of the hardest lessons I had to learn, however, was that I wasn't suited for leadership. Don't know if you can really tell, @. But it's just not my thing.$24#$b#So, I scattered the druids. This way, they'd spread the teachings and start conclaves of their own.$23#$b#I may no longer be able to travel far from The Grove, since I'm the only remaining druid connected to it, but I thought that a fair concession.$14\"/emote Roslin 40/pause 250/speak Roslin \"That's... quite a sacrifice to make. Do you miss the world outside the valley?$13\"/speak Hector \"Not one bit. I made my choices, I'm proud of them, and I'll stand by them.$12\"/emote Roslin 12/pause 250/speak Roslin \"You're... making me empathize with Lewis, of all people.$14\"/speak Hector \"I don't like him, but I won't claim to be suited to managing a whole town of people.$14\"/speak Roslin \"I suppose Marlon isn't in the wrong, either. He's lacking in context, but it's wrong to have made such a harsh judgement...$16\"/quickQuestion #Why did you leave the White Lodge, anyway? #Why won't Dandelion join the Adventurer's Guild?(break)speak Roslin \"Shadowfolk have a more intrinsic connection with Aether than Humans do, so I befriended one. The Lodge didn't approve.$17#$b#At the time, we were debating waging war against them. I was considered a traitor, so I left before I could be...removed.$15#$b#I don't regret my decision. I know I'm rough around the edges, but I've always believed in the moral good.$10\"(break)speak Roslin \"Dandelion couldn't, originally. She was already part of a Paladin Order; so she couldn't have other commitments, as part of the oath she took.$4#$b#That...includes people commitments, if you catch my drift. So, I get to be the entirely flattering reason her being deposed.$12\"\\speak Hector \"So Marlon's entirely off base in his estimations. Color me surprised.$6\"/speak Roslin \"Anyway, thank you for your help, Bir贸g. @.$14\"/emote farmer 32/speak Hector \"You're in good company, Roslin. We'll work this out.$12\"/fade/viewport -1000 -1000/speak Hector \"I promise.$13\"/pause 250/end"
      },
    },
    {
      "LogName": "Roslin's 3 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_LionsMane",
      "Entries": {
        "SnS.Ch4.Roslin.4/e SnS.Ch4.Roslin.3/f Roslin 750/t 0800 2200/A RoslinAndHector/w sunny/F": "SnS.RoslinTheme/-100 -100/farmer -100 -100 0 Cirrus 29 30 2 Roslin 14 30 1/animate Cirrus false true 200 16 16 17 17 18 18 19 19 20 20 21 21 22 22 23 23 24 24 25 25/globalFadeToClear/skippable/addConversationTopic RoslinAndCirrus {{VariableTimegate}}/viewport 26 25 clamp true/pause 1000/advancedMove Roslin false 13 0 1 10/pause 500/emote Roslin 12/pause 500/waitForAllStationary/stopAnimation Cirrus/stopMusic/faceDirection Cirrus 3 true/emote Cirrus 8/speak Cirrus \"Hey, Roslin! Something on your mind?$1\"/playMusic SnS.LonelyTheme/speak Roslin \"Yeah, actually. I'm wondering how you've got the energy to be jovial in the face of being told there's a giant monster beneath your feet.$5\"/speak Cirrus \"Oh, well. That's fair, I suppose-$3\"/playSound doorOpen/warp farmer 26 34/faceDirection Roslin 2 true/emote Roslin 40/faceDirection Cirrus 2 true/emote Cirrus 16/advancedMove farmer false 0 -3 2 0 4 10/speak Cirrus \"Hey, @!\"/emote farmer 32/pause 250/faceDirection Cirrus 3 true/faceDirection Roslin 1/speak Cirrus \"Your question caught me a little off-guard, Roslin. I'll admit. But I think it's really important to find small joys even when things are bleak.$17\"/emote farmer 8/pause 250/speak Roslin \"Aren't you afraid?$17\"/speak Cirrus \"Oh, I'm plenty afraid. But I've been afraid my whole life, Roslin. Fear is part of the human experience.$22\"/speak Roslin \"That... is very bold, and very wise. Those don't often go hand-in-hand.$10\"/speak Cirrus \"I'm scared of the rain, Roslin! And rain is inevitable, I can't control it. But it's just something I've learned to live with.$1#$b#When I changed careers, it was the scariest thing I've ever done - but here I am, grateful to have made the leap despite the fear.$15#$b#I had even lost my passion for music, and THAT scared me. But when I found it again, it came with magic - magic that I'm getting closer to mastering every day.$22\"/speak Roslin \"Ah, you're a bard. That doesn't surprise me as much as the lapse in your interest does.$11\"/speak Cirrus \"It's a long story, but what I'm getting at... is that fear is constant, and you shouldn't deprive yourself of little joys just because of it.$17#$b#I know you're hurting for Dandelion. That's okay to feel. But that won't keep the sun from shining, or the birds from singing, so you might as well enjoy.$1\"/speak Roslin \"That's exactly the sort of sugar-sweet thing Dandelion would say.$12\"/quickQuestion #Why don't you tell us a little about her? #How did you two meet?(break)speak Roslin \"Well, she's heroic as if it's her nature. I really admire that; she always puts others before herself, and she's very kind.$10#$b#She likes to read. If she wasn't an adventurer, I think she'd like to own a bookstore. She mentioned wanting to retire and be a writer, once.$11#$b#I miss her. I hope my spell worked; I'd like to reunite with her soon. It's like missing my other half.$13\"(break)speak Roslin \"Well, I was buying a pastry from a street vendor, and I was lacking the change. Dandelion paid for it, as she was nearby as I was fumbling through my pockets.$19#$b#We met again later, fighting a monster. I tried to pay her back after that, but she refused. So I said I'd accompany her on her next mission as thanks...$18\"\\speak Cirrus \"And then you never stopped accompanying her. How cute!$4\"/speak Roslin \"Thank you both for listening. It... does feel good to indulge in a little reminiscing.$3\"/speak Cirrus \"It's okay to take a breath, Roslin. I know things are dire, but you won't help yourself being wound up all the time.$17\"/speak Roslin \"You're right... I'm sorry to have interrupted your song, would you like to continue? I'd love to listen.$11\"/textAboveHead Cirrus \"Gladly!\"/playMusic SnS.CirrusTheme/animate Cirrus false true 200 16 16 17 17 18 18 19 19 20 20 21 21 22 22 23 23 24 24 25 25/viewport move 0 -1 5000/pause 4000/fade/viewport -1000 -1000/speak Roslin \"For what it's worth, Cirrus - I know you've only recently learned of your prowess, but you are positively dripping with Aether.$10#$b#That is to say, I think Bardic mastery will come easily to you one day.$11\"/speak Cirrus \"Thank you, Roslin. I've been so much more engaged with music again, and I think that's helping a lot.$23#$b#I'm excited about my abilities, and I'm excited to share them with the people around me.$1\"/pause 250/end"
      },
    },
    {
      "LogName": "Cirrus's Ginger Beer Unlock Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_LionsMane",
      "Entries": {
        "SnS.Ch4.Cirrus.1/e SnS.Ch4.Roslin.3/f Cirrus 2500/t 800 2200/w sunny/F": "SnS.CirrusTheme/-100 -100/farmer 21 21 0 Cirrus 24 16 0/addConversationTopic CirrusGingerBeer 1/skippable/playSound doorClose/fade/viewport 24 16/advancedMove farmer false 0 -5 2 0 1 10/emote farmer 8/pause 250/emote Cirrus 16 true/jump Cirrus 5/faceDirection Cirrus 3/speak Cirrus \"@! I'm glad you're here, I had something I wanted to give you.$1[(O){{ModID}}_strawberrygingerbeer]\"/pause 250/emote farmer 40/pause 250/speak Cirrus \"It's Ginger Beer! I started making it myself. You add fruit and ginger to the jar, and then you've got a delicious drink! You can even age it.$17#$b#I wanted to do something to celebrate my sobriety, so homemaking a fancy non-alcoholic drink seemed about right...$22#$b#Why don't you try, @? You grow so much cool stuff on your farm. It'd make a great alternative to wine. So, all you need is...$1\"/fade/viewport -1000 -1000/action MarkCraftingRecipeKnown Current {{ModID}}_oldfashionedfermenter/playSound discoverMineral/message \"You can now craft Old-Fashioned Fermenters! Add ginger and either orange, blueberry, pineapple, rhubarb, strawberry, peach, ancient fruit, ancient huckleberries, ancient appleberries, or ancient elderberries to make Ginger Beer, which can be aged.\"/pause 250/end",
      },
    },
    {
      "LogName": "Roslin's 4 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_CoastalGuild",
      "Entries": {
        "SnS.Ch4.Roslin.5/e SnS.Ch4.Roslin.4/f Roslin 1000/t 800 2200/A RoslinAndCirrus/w sunny/F": "SnS.LonelyTheme/-100 -100/farmer 7 12 3 Cirrus 14 12 0 Mateo 11 12 1 Hector 5 16 3 Roslin 12 12 3 Lewis -100 -100 0/skippable/addConversationTopic RoslinAndLewis {{VariableTimegate}}/addTemporaryActor MateoEmeritus 32 32 2 17 2 true Character/addTemporaryActor MateoMarlon 16 32 -100 -100 0 true Character/addTemporaryActor MateoGunther 16 32 -100 -100 2 true Character/addTemporaryActor FakeSolomon 32 32 -100 -100 2 true Character/globalFadeToClear/changeName MateoEmeritus Emeritus/changeName FakeSolomon Solomon/changeName MateoMarlon Marlon/changeName MateoGunther Gunther/viewport 13 12 clamp true/pause 1000/emote Mateo 40/pause 250/speak Roslin \"I did discuss it with Bir贸g, while there's the potential for an unusual side-effect, it shouldn't be anything catastrophic, although-$8\"/speak Mateo \"I don't know much about magic, but I do know a lot of it is intent and manifestation, no?$36#$b#Things will be alright, Roslin. The more you fret about it, the worse off you'll be.$78\"/pause 250/emote Roslin 28/pause 250/speak Roslin \"I wish I could be as positive as you.$13\"/speak Mateo \"Your companion is in a dangerous situation. There's no expectation for you to be positive; the best we can all do is support you through it.$21\"/speak Roslin \"Thank you, Guildmaster.$10\"/speak Mateo \"Please, don't. I hate titles.$1\"/playSound doorOpen/warp Lewis 10 19/faceDirection farmer 2 true/emote Roslin 16 true/emote Hector 8 true/emote Cirrus 40 true/faceDirection Mateo 2 true/faceDirection Roslin 2 true/faceDirection Cirrus 3 true/faceDirection Hector 1 true/advancedMove farmer false 3 0 2 10/advancedMove Lewis false 0 -5 2 0 4 10/pause 250/warp MateoMarlon 10 19/advancedMove MateoMarlon false 0 -5 1 0 4 10/pause 250/warp MateoGunther 10 19/advancedMove MateoGunther false 0 -5 4 10/waitForAllStationary/advancedMove Hector false 6 0 4 10/speak Roslin \"Gentlemen.$5#$b#To what do we owe such a visit? We're in the middle of something very important, so if you'd please make it quick-$15\"/pause 250/emote Lewis 40/pause 250/speak Lewis \"Roslin, we're here to offer an apology-$2\"/pause 250/emote Roslin 12/pause 250/speak Roslin \"Words won't do me any good, old man. I have no interest in an attempt to soothe your own feelings.$5\"/speak MateoGunther \"That's precisely why Lewis and Marlon are here to speak to something more practical.$1\"/pause 250/emote Mateo 8 true/emote Roslin 8 true/emote farmer 8 true/emote Hector 8 true/emote Cirrus 8 true/pause 250/speak MateoMarlon \"I sent word out to the adventurers stationed in Castle Village, Port Drake and Grampleton.$5#$b#Unfortunately, kid, nobody's budging soldiers without proof. The Valley has always been sleepy; something like what you n' Roslin are implying is unprecedented.$2\"/pause 250/emote Mateo 40/pause 250/speak Mateo \"I appreciate that you tried, Marlon. I'm just disappointed, is all.$21\"/speak MateoMarlon \"I know. They could've done better; I could've done better, too. I'm sorry. Feels like I failed ya' when ya' really needed me.$2\"/speak Mateo \"You tried, and that matters more to me than anything else.$76\"/pause 250/speak Lewis \"It's not all bad news, though. Since we couldn't secure martial assistance, we did get something else.$0\"/speak Roslin \"I'm... listening.$0\"/stopMusic/playMusic SnS.MateoTheme/speak Lewis \"I've brought a donation for the Coastal Adventurer's Guild on behalf of Pelican Town and East Scarp. The intent is to contribute to new equipment, or whatever else you may need.$1\"/pause 250/playSound purchase/jump Mateo 5 true/emote Mateo 16/textAboveHead Mateo \"Oh, wow, that's a heavy looking bag-\"/pause 250/speak MateoMarlon \"There should be enough there to divvy it up real well.$0\"/pause 250/emote Roslin 60/pause 250/speak Roslin \"Thank you for organizing this, it... it helps, a lot. Just to be acknowledged for trying to help this entire time.\"/jump MateoGunther 5/speak MateoGunther \"And that's not all!$0\"/emote farmer 8 true/emote Hector 8 true/emote Roslin 8 true/emote Mateo 8 true/emote Cirrus 32/pause 250/speak MateoGunther \"Dearest Cirrus reached out to me, as well. You are a storied scholar, Roslin. Is that correct?$1\"/speak Roslin \"I am. I've worked with the Archaeological Foundation before, actually.$3\"/speak MateoGunther \"I was able to unearth your contributions-$0\"/textAboveHead Mateo \"Did you just pun-?\"/pause 1000/speak MateoGunther \"Perhaps.$1#$b#Anyway! I advocated for a small grant for you, Roslin, at Cirrus' suggestion.$1\"/jump Roslin 5 true/emote Roslin 16 true/emote Cirrus 20/speak MateoGunther \"I understand you've been couch-surfing since you made yourself properly known.$0#$b#This will go directly toward remodeling the rest of the Lion's Mane, so you have a suitable place to continue your magical research.$1\"/speak Cirrus \"And so that Dandelion has a place to come HOME to!$1\"/faceDirection Roslin 1/pause 500/faceDirection Roslin 2/speak Roslin \"That's so thoughtful, I'm...$2#$b#I'm overwhelmed.$6\"/speak Cirrus \"It's okay! This is all kind of a lot.$17\"/advancedMove Hector false -6 0 3 10/speak Hector \"(Maybe there's hope for Pelican Town's leadership after all.)$14\"/stopAnimation MateoEmeritus/faceDirection MateoEmeritus 1/waitForAllStationary/speak Mateo \"Honestly, I don't know what to say. This is such a turnaround from where we left off.$80\"/speak Lewis \"I'm sorry I wasn't more attentive to this. I acknowledge that, had I been, your friend may not be in the situation she's in now.$2#$b#I know it may not entirely make things right, but I hope it's a suitable start.$2\"/speak Roslin \"It is. Thank you, Lewis. Marlon. Gunther.$3\"/pause 500/fade/viewport -1000 -1000/message \"By this time tomorrow, The Lion's Mane will get an upgrade! In addition, Mateo has given you your share of the donated Adventurer Funds.\"/playSound purchase/money 10000/speak FakeSolomon \"What the hell, suddenly these people give a darn. That's wild.$2\"/speak Roslin \"It's something, isn't it? How things are turning around.$3\"/speak FakeSolomon \"For YOU! Meanwhile, I'm not getting ANY attention!$5\"/speak Roslin \"I suppose that's fair. Maybe introductions are finally in order; I can't say I trusted these folk before, but now...$1\"/speak FakeSolomon \"They're gonna LOVE me!$6\"/speak Roslin \"They'll probably tolerate you.$7\"/speak FakeSolomon \"Hey!$8\"/pause 250/end",
      },
    },
    {
      "LogName": "Roslin's 5 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_CoastalGuild",
      "Entries": {
        "SnS.Ch4.Roslin.6/e SnS.Ch4.Roslin.5/f Roslin 1250/t 800 2200/A RoslinAndLewis/w sunny/n Roslin_SpecialOrders_RoslinEssenceMail/F": "SnS.LonelyTheme/-100 -100/farmer 10 12 2 Cirrus 10 14 0 Mateo 12 12 2 Hector 12 14 0 Roslin -200 -200 2 Dandelion -200 -200 2/skippable/addConversationTopic DandelionReturns {{VariableTimegate}}/addTemporaryActor MateoEmeritus 32 32 2 17 2 true Character/addTemporaryActor FakeDandelion 16 32 -100 -100 0 true Character/addTemporaryActor FakeRoslin 16 32 11 14 0 true Character/addTemporaryActor FakeSolomon 43 45 -100 -100 2 true Character/globalFadeToClear/changeName MateoEmeritus Emeritus/changeName FakeSolomon Solomon/changeName FakeDandelion Dandelion/changeName FakeRoslin Roslin/changePortrait Hector hooddown/changeSprite Hector hooddown/changePortrait Cirrus Glamrock/changeSprite Cirrus Glamrock/viewport 13 12 clamp true/pause 1000/speak Mateo \"Alright! Now that we're geared and have all the supplies we could possibly need, let's get this rescue mission underway.$82\"/speak Hector \"Honestly, I was expecting some kind of... I don't know, dramatic motivational speech.$24\"/speak Cirrus \"This IS kind of a big deal, I don't disagree.$17\"/speak FakeRoslin \"I'm too anxious to hear out a speech.$2\"/speak Mateo \"That's what I figured, Roslin. I'll keep it short: Adventurers have to stick together.$78#$b#Part of that is making sure nobody gets left behind, or forgotten.$80\"/pause 250/emote FakeRoslin 40/pause 250/speak FakeRoslin \"Nobody gets left behind, or forgotten...$13\"/fade/viewport -1000 -1000/speak FakeRoslin \"Nobody gets left behind, or forgotten... Maybe if I keep repeating it, it'll turn out to be true.$14\"/changeLocation EastScarp_DeepDark/warp MateoEmeritus -200 -200/warp Mateo 11 14/faceDirection Mateo 0/warp farmer 9 14/faceDirection farmer 0/warp FakeRoslin 10 14/faceDirection FakeRoslin 0/warp Cirrus 8 14/faceDirection Cirrus 0/warp Hector 7 14/faceDirection Hector 0/viewport 10 14 clamp true/pause 1000/speak Hector \"I feel ill just being near here.$18\"/speak Cirrus \"Are you going to be alright?$18\"/speak Hector \"Yes. It just indicates that something is wrong down here - something very, very wrong.$19\"/speak FakeRoslin \"Don't come along if-$5\"/speak Hector \"It's nothing I haven't experienced before! Isn't that right, @? But, if anything, it's a sign to take caution. We don't know what we're walking into.$8\"/pause 250/emote Mateo 40/pause 250/speak Mateo \"Let's press on. I don't want Bir贸g exposed to this place for longer than necessary.$37\"/pause 250/fade/viewport -1000 -1000/speak FakeRoslin \"Great, I made new friends and I'm immediately putting them in danger. Another potential disaster to add to an already generous supply.$14\"/changeLocation EastScarp_DeepDarkLv0/warp farmer 17 8/faceDirection farmer 1/warp Hector 17 9/faceDirection Hector 1/warp Cirrus 17 7/faceDirection Cirrus 1/warp Mateo 18 7/faceDirection Mateo 2/warp FakeRoslin 18 9/faceDirection FakeRoslin 0/fade/viewport 18 8 clamp true/pause 1000/speak Cirrus \"I've been all over the world, but I've never seen anything like this.$20\"/speak FakeRoslin \"This whole place is corrupted.$17\"/speak Hector \"There are aspects of this place that are naturally occurring, but...$23#$b#Something is definitely out of sorts.$24\"/speak Mateo \"Didn't you mention that grief can coalesce, Roslin? Is that what must've happened?$34\"/speak FakeRoslin \"Must be. That means since the first time Dandelion and I examined this place, it's quickly gotten worse...$13\"/speak Cirrus \"You've been grieving, and we've been grieving with you...$2\"/pause 250/fade/viewport -1000 -1000/changeLocation EastScarp_DeepDarkLv1/warp farmer  22 23/faceDirection farmer 3/warp Hector 22 24/faceDirection Hector 3/warp Cirrus 22 21/faceDirection Cirrus 3/warp Mateo 22 25/faceDirection Mateo 3/warp FakeRoslin 22 20/faceDirection FakeRoslin 3/fade/viewport 19 22 clamp true/pause 1000/speak Mateo \"How far does this go down?$20\"/speak FakeRoslin \"Too far...$13\"/speak Hector \"What are those creatures?$18\"/speak Cirrus \"They're so creepy!$18\"/speak FakeRoslin \"They're... what's left.$16\"/speak Mateo \"I don't like the sound of that.$17\"/fade/viewport -1000 -1000/changeLocation EastScarp_DeepDarkLv2/warp farmer  6 32/faceDirection farmer 3/warp Hector 4 30/faceDirection Hector 0/warp Cirrus 10 35/faceDirection Cirrus 3/warp Mateo 9 35/faceDirection Mateo 1/warp FakeRoslin 15 27/faceDirection FakeRoslin 0/fade/viewport 10 26 clamp true/pause 500/advancedMove Hector false 0 -25 4 10/emote farmer 8/pause 250/faceDirection FakeRoslin 3/pause 250/faceDirection FakeRoslin 1/pause 250/faceDirection FakeRoslin 2/pause 250/emote FakeRoslin 40/pause 500/fade/viewport -1000 -1000/waitForAllStationary/changeLocation EastScarp_DeepDarkLv3/warp farmer  29 29/faceDirection farmer 1/warp Hector 29 28/faceDirection Hector 1/warp Cirrus 18 26/faceDirection Cirrus 0/warp Mateo 29 27/faceDirection Mateo 2/warp FakeRoslin 19 26/faceDirection FakeRoslin 3/fade/viewport 25 26 clamp true/pause 1000/speak Hector \"This is a root of my tree. No wonder...$18\"/speak Mateo \"I thought you'd started to feel better after the river.$21\"/speak Hector \"Maybe a little more nuance was warranted... I assumed the lingering fatigue had become chronic, not that there'd be another cause.$19\"/pause 250/fade/viewport -1000 -1000/changeLocation EastScarp_DeepDarkLv4/warp farmer 43 22/faceDirection farmer 0/warp Hector 42 22/faceDirection Hector 0/warp Cirrus 45 22/faceDirection Cirrus 0/warp Mateo 44 22/faceDirection Mateo 0/warp FakeRoslin 43 20/faceDirection FakeRoslin 0/fade/viewport 43 20 clamp true/pause 1000/speak FakeRoslin \"Dandelion cleared this place out by herself. She must've been so tired by the time she encountered that final beast.$14\"/speak Mateo \"I guess I'm grateful there aren't any monsters left for us, but...$21\"/speak Hector \"But there's a cost.$22\"/speak Cirrus \"Poor Dandelion.$29\"/pause 250/fade/viewport -1000 -1000/changeLocation EastScarp_DeepDarkLv5/warp farmer  9 10/faceDirection farmer 2/warp Hector 8 11/faceDirection Hector 1/warp Cirrus 11 11/faceDirection Cirrus 3/warp Mateo 11 12/faceDirection Mateo 3/warp FakeRoslin 14 13/faceDirection FakeRoslin 3/fade/viewport 10 26 clamp true/pause 1000/speak Cirrus \"This can't be-$2\"/speak Mateo \"It's not, this skeleton looks way too old.$37\"/speak Cirrus \"Poor fella.$2\"/pause 250/emote FakeRoslin 40 true/faceDirection Roslin 1/pause 250/speak FakeRoslin \"...There's a passage over there.$15\"/viewport move 2 0 3000/pause 3000/fade/viewport -1000 -1000/changeLocation EastScarp_DuskspireLair/warp Mateo -200 -200/warp farmer -200 -200/warp Cirrus -200 -200/warp Hector -200 -200/warp FakeDandelion 18 13/showFrame FakeDandelion 45/warp FakeRoslin 3 15/faceDirection FakeRoslin 1/fade/viewport 13 13 clamp true/pause 1000/emote FakeRoslin 16/advancedMove FakeRoslin false 13 0 0 -2 1 10/pause 1000/warp Mateo 3 15/advancedMove Mateo false 10 0 0 -3 1 10/pause 500/warp Hector 3 15/advancedMove Hector false 10 0 0 -2 1 10/pause 500/warp Cirrus 3 15/advancedMove Cirrus false 10 0 0 -1 1 10/pause 500/warp farmer 3 15/advancedMove farmer false 13 0 4 10/waitForAllStationary/speak FakeRoslin \"Dandelion, is this all that's left of you? Your shield?$2\"/textAboveHead FakeDandelion \"Ros...lin...\"/pause 2500/emote Mateo 16 true/emote Cirrus 16 true/emote Hector 16 true/emote farmer 16 true/jump FakeRoslin 6 true/emote FakeRoslin 16/pause 250/speak Mateo \"She's alright-!$25\"/speak Cirrus \"Dandelion!$10\"/speak Hector \"Roslin, how are you going to reverse your spell-?$8\"/speak FakeRoslin \"The same way any other Sorcerer Supreme would-$11\"/pause 250/emote Hector 8/pause 250/speak FakeSolomon \"WITH! STYLE!$1\"/emote Cirrus 16 true/emote farmer 16 true/emote Mateo 16 true/emote Hector 16 true/pause 250/warp FakeRoslin -200 -200 true/playSound cavedrip/warp FakeSolomon 15 13 true/faceDirection FakeSolomon 1/speak FakeSolomon \"Infinite void power! Itty bitty vessel!$6\"/speak FakeRoslin \"If it was infinite, we wouldn't have needed so much help!$9\"/speak FakeSolomon \"Whatever, just let me have my fun-$10\"/speak FakeRoslin \"Less monologuing, more casting! Let's go!$15\"/speak FakeSolomon \"Alright, fine!$11#$b#From steel to marrow, change her back! Return with which the Paladin lacks! Let flesh and bone replace the shield, restore the form The Beast did steal!$6\"/speak FakeRoslin \"By this chant, we break the seal - become a human, true and real!$11\"/pause 250/playSound wand/screenFlash 5/showFrame FakeDandelion 46/pause 500/showFrame FakeDandelion 47/pause 500/showFrame FakeDandelion 48/pause 500/showFrame FakeDandelion 49/pause 500/showFrame FakeDandelion 50/pause 500/showFrame FakeDandelion 51/pause 500/showFrame FakeDandelion 52/pause 500/showFrame FakeDandelion 53/pause 500/speak FakeRoslin \"Dandelion...$18\"/pause 250/emote FakeDandelion 40/pause 250/faceDirection FakeDandelion 1/pause 250/faceDirection FakeDandelion 2/pause 250/faceDirection FakeDandelion 0/pause 250/showFrame FakeDandelion 54/speak FakeDandelion \"I regret to inform you, Darling, that we've got no time for a proper reunion - we need to escape, immediately!$16\"/speak FakeRoslin \"Or what? You left the place empty-$16\"/stopMusic/pause 250/playMusic SnS.DuskspireLaugh/pause 1000/speak Mateo \"She's right, we've got to run-$3\"/speak Hector \"Oh, yikes-$18\"/pause 250/emote Cirrus 56/animate Cirrus false true 100 16 16 17 17 18 18 19 19 20 20 21 21 22 22 23 23 24 24 25 25/playMusic SnS.KeytarSolo/faceDirection Mateo 2 true/faceDirection Hector 2 true/faceDirection farmer 3 true/faceDirection FakeSolomon 3 true/speak FakeDandelion \"Now we're cooking with fire!$18\"/speak Mateo \"Go Cirrus, go!$14\"/speak Hector \"Atta' girl!$8\"/speak FakeRoslin \"That's our Bard!$7\"/speak FakeSolomon \"Wait, what's happeni-$3\"/pause 500/screenFlash 3/playSound warrior/fade/viewport -1000 -1000/changeLocation EastScarp_LionsMane/stopAnimation Cirrus/warp FakeRoslin 6 28/faceDirection FakeRoslin 2/warp FakeDandelion 7 28/faceDirection FakeDandelion 2/warp Mateo 5 30/faceDirection Mateo 0/warp farmer 6 30/faceDirection farmer 0/warp Cirrus 7 30/faceDirection Cirrus 0/warp Hector 8 30/faceDirection Hector 0/playMusic SnS.HopeTheme/fade/viewport 7 25 clamp true/pause 1000/speak Mateo \"It's nice to finally meet you, Dandelion!$1\"/speak FakeDandelion \"I'm sure we'll be able to get acquainted after some rest. You all must be exhausted.$6\"/speak FakeRoslin \"You, most of all!$9\"/speak FakeDandelion \"I'm fine, considering.$13\"/pause 250/emote FakeRoslin 12/pause 250/speak FakeDandelion \"Thank you kindly for the save. Truly, you're an excellent team of adventurers.$14\"/speak Hector \"Not just a nerd club after all, I suppose.$8\"/speak FakeDandelion \"Oh! Wait, do you all play tabletop-? Is that what you mean? Do you have an open seat-? I have my own books-$1\"/speak FakeRoslin \"Dandelion, you've been back for like two seconds...$3\"/fade/viewport -1000 -1000/pause 250/speak FakeDandelion \"And I already love it here!$18\"/message \"Dandelion will now live at The Lion's Mane with Roslin! You're beat from your journey, so you turn in for the night...\"/end newDay",
      },
    },
    {
      "LogName": "Dandelion's 0 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_LionsMane",
      "Entries": {
        "SnS.Ch4.Dandelion.1/e SnS.Ch4.Roslin.6/f Roslin 1250/t 800 2200/A DandelionReturns/w sunny/F": "SnS.DandelionTheme/-100 -100/farmer 3 21 0 Roslin 11 16 3 Dandelion 8 16 1 Solomon 10 17 0 Cirrus 22 6 0/globalFadeToClear/skippable/addConversationTopic DandelionSettling {{VariableTimegate}}/playSound doorOpen/animate Cirrus false true 100 16 16 17 17 18 18 19 19 20 20 21 21 22 22 23 23 24 24 25 25/viewport 10 15 clamp true/pause 1000/advancedMove farmer false 0 -4 6 0 1 10/emote Dandelion 16 true/emote Roslin 40 true/emote Solomon 8 true/faceDirection Dandelion 2 true/faceDirection Roslin 2 true/faceDirection Solomon 3 true/speak Solomon \"Ah, hello @. Seems you're just in time for tea.$7\"/pause 250/emote Dandelion 20/pause 20/speak Dandelion \"It's always time for tea.$1\"/pause 250/emote farmer 40/pause 250/quickQuestion #I didn't realize you and Roslin could separate. #Are you settling in okay, Dandelion?(break)speak Solomon \"Yeah, it's not exactly practical when we're out on the road, but...$2#$b#Since we're homebodies now, I can make the Lion's Mane the Lion's MINE.$6\"\\speak Roslin \"He's allowed freedom from his shadowy confines as long as he stays in the building and doesn't cause a ruckus.$1\"\\speak Solomon \"The Bard likes me, and feeds me lots of snacks. So I'll take being here over my prior itty-bitty living space.$3#$b#And besides, I have my own cave underneath. It's quite nice! And watching the counter for the shop isn't a bad gig.$0\"\\pause 10(break)faceDirection Solomon 0 true\\faceDirection farmer 0\\speak Dandelion \"Well! I'm doing... ha, dandy, quite honestly!$6#$b#Thank you for reuniting me with my little family, @. Your contributions cannot go understated.$13\"\\speak Roslin \"It's been great to have her back. I... missed her, quite a lot.$12\"\\faceDirection Roslin 3 true\\faceDirection Dandelion 1\\speak Dandelion \"I missed you too, Roslin.$4\"\\pause 250\\emote Roslin 60\\pause 250/faceDirection Roslin 2 true/faceDirection Dandelion 2 true/faceDirection Solomon 0 true/faceDirection farmer 0 true/speak Dandelion \"Oh, two things before you go, @. One, I'd like to send you home with some leftovers. Best keep your energy up!$14[(O){{ModID}}_dandeliongreens]#$b#And second, I've been working on something since I've returned, and may be recruiting you for a task in the near future. Don't worry, it'll be to all our benefit.$15#$b#I'd like to be helpful during our next encounter with the beast-$13\"/speak Roslin \"I still don't think you should ever step foot in those caves again.$16\"/speak Dandelion \"What kind of hero would I be if I didn't join you and the others to put an end to the Duskspire Behemoth's tyrrany?$18#$b#Don't worry, @. Between the seven of us, he won't stand a chance.$14\"/pause 250/emote farmer 32/pause 250/fade/viewport -1000 -1000/speak Roslin \"Dandelion won't stop until that thing is gone for good.$17\"/speak Solomon \"Bah, that thing stands no chance against The Power Of Friendship.$6#$b#Or whatever the heck it is you guys do.$8\"/speak Roslin \"Maybe then, her and I can finally put Sword and Sorcery to rest.$13\"/end"
      },
    },
    {
      "LogName": "Dandelion's 2 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_Underforge",
      "Entries": {
        "SnS.Ch4.Dandelion.2/e SnS.Ch4.Dandelion.1/f Roslin 1250 Dandelion 500/t 800 2200/A DandelionReturns/w sunny/F": "SnS.DandelionTheme/-100 -100/farmer 16 13 3 Mateo 12 7 3 Dandelion 10 7 1/globalFadeToClear/viewport 11 7 clamp true/skippable/addConversationTopic DandelionShieldRepair {{VariableTimegate}}/pause 1000/emote farmer 8/advancedMove farmer false 0 -3 -5 0 0 -2 4 10/speak Mateo \"It's definitely doable. I'll just need a lot of supplies if you want an upgrade from your last one.$35#$b#I do have some ideas on how I could one-up a solid slab of Iridium.$36\"/waitForAllStationary/jump farmer 5 true/emote farmer 16/pause 250/faceDirection Dandelion 2 true/faceDirection Mateo 2 true/pause 250/speak Dandelion \"My shield was always a heavy burden to bear. Literally.$6\"/pause 250/emote farmer 40/pause 250/speak Mateo \"You'd help, @? Some of the stuff I'm looking for is a bit scarce...$76\"/speak Dandelion \"You're correct to assume this was the task I needed assistance with, @.$1#$b#Roslin won't let me step foot in a dungeon without a party at my back, so I can't gather them myself.$2\"/speak Mateo \"I can't exactly blame her.$16\"/pause 250/emote farmer 32/pause 250/speak Mateo \"Thank you, @.\"/speak Dandelion \"Yes, thank you. In the meantime, I'll continue my strength training! And you should do the same.$13\"/speak Mateo \"I feel like you could already lift a car if you wanted to...$13\"/fade/viewport -1000 -1000/speak Dandelion \"That means, obviously, the next reasonable goal is to be able to lift a truck. And throw it, of course.$18\"/addSpecialOrder CAGQuest.UntimedSpecialOrder.DandelionShield/end"
      },
    },
    {
      "LogName": "Dandelion's 4 Heart Event",
      "Action": "EditData",
      "Target": "Data/Events/EastScarp_Underforge",
      "Entries": {
        "SnS.Ch4.Dandelion.3/e SnS.Ch4.Dandelion.2/f Roslin 1750 Dandelion 1000/t 800 2200/A DandelionShieldRepair/n Dandelion_SpecialOrders_DandelionShieldMail/w sunny/F": "SnS.DandelionTheme/-100 -100/farmer 16 13 3 Mateo -100 -100 2 Dandelion 10 7 1/addTemporaryActor BlacksmithMateo 32 32 13 6 2 true Character/showFrame BlacksmithMateo 0/positionOffset BlacksmithMateo 0 -10/positionOffset BlacksmithMateo -50 0/ignoreCollisions BlacksmithMateo/globalFadeToClear/viewport 11 7 clamp true/skippable/addConversationTopic DandelionShieldRestored {{VariableTimegate}}/pause 1000/advancedMove farmer false 0 -3 -5 0 0 -2 4 10/emote farmer 40/changeName BlacksmithMateo Mateo/speak BlacksmithMateo \"You're just in time, @. Glad you could make it. Thanks for getting everything together.$14\"/speak Dandelion \"After seeing everything you've made for The Lion's Mane, I'm terribly excited to see what you've come up with.$13\"/speak BlacksmithMateo \"I've put a lot of thought into this design. It should be very... you.$76\"/showFrame BlacksmithMateo 3/speak Dandelion \"Have at it then!$18\"/speak BlacksmithMateo \"Here goes nothing!$82\"/animate BlacksmithMateo false true 100 5 4 6 7/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound hammer/pause 300/playSound stardrop/screenFlash 15/stopAnimation BlacksmithMateo/showFrame BlacksmithMateo 0/addTemporaryActor DandelionShield 16 16 11 5 2 false Character/positionOffset DandelionShield 30 0/pause 2000/emote Dandelion 16 true/jump Dandelion 5 true/emote farmer 16 true/jump Dandelion 5 true/positionOffset DandelionShield 0 2/positionOffset DandelionShield 0 2/positionOffset DandelionShield 0 2/positionOffset DandelionShield 0 2/positionOffset DandelionShield 0 2/pause 500/emote Dandelion 40/pause 500/advancedMove Dandelion false 2 0 4 10/pause 500/advancedMove farmer false 0 -1 4 10/pause 1000/speak Dandelion \"It's beautiful... Mateo, this is the most incredible armament I've ever seen.$6\"/speak BlacksmithMateo \"Thanks, Dandelion. That means a lot, coming from you.$29#$b#It wouldn't have been possible without @, though.$27\"/faceDirection Dandelion 3 true/faceDirection farmer 1 true/speak Dandelion \"I do have a gift for you, @. Bir贸g started teaching me about ancient tea varieites, so I thought I'd share these with you as thanks for all your help.[(O){{ModID}}_ancientsweettealeaves.seed]\"/action MarkCookingRecipeKnown Current {{ModID}}_ancientsweettea/action MarkCraftingRecipeKnown Current {{ModID}}_ancientsweettealeaves.seed/emote farmer 56/speak Dandelion \"Ancient Sweet Tea prospers in either extreme - hot, or cold. It's quite resilliant that way! And it brews a very lovable drink, I'll tell you what.$1\"/fade/viewport -1000 -1000/speak BlacksmithMateo \"Seems like none of my hobbies just stay hobbies. I'm really proud of what I made...$12\"/speak Dandelion \"Interests are like plants! If you water them, they'll grow!$14\"/end"
      },
    },
  ]
}
/* 

quickQuestion #That girl sounds overwhelmed. #That voice is familiar.(break)speak Mateo \"Let's check in on things, just in case.$32\"(break)speak Hector \"Right? Reminds me of something I was watching with Eloise...$7\"

(0 = up, 1 = right, 2 = down, 3 = left)

waitForAllStationary - waits until all advMoves are complete for next action 

stopAdvancedMoves - will prevent clipping issues at the end of an event when characters advMove off screen

advancedMove true/false (loop) parameters

parameters:
x y x y x y = move without pause

x y z t x y z t = move with pauses

x y x y z t x y = move with mix of mentioned above

x = how many tiles move in x axis (+ = right, - = left)
y = how many tiles move in y axis (+ = down, - = up)
z = direction face upon reaching destination (1=right, 2=down, 3=left, 4=up)
t = duration in milliseconds how long to stay in that spot (must be >= 10000ms)

4- empty can
8- question mark
12- angry
16- exclamation
20- heart
24- sleep
28- sad
32- happy
36- x
40- pause
52- video game
56- music note
60- blush 

*/